#include <iostream>
using namespace std;
#include "Flat.h"
#include "Overcoat.h"


//Завдання №1
//Створити клас Overcoat(верхній одяг).Реалізувати
//перевантажені оператори :
//1. Перевірка на рівність типів одягу(операція « == »).
//2. Операцію присвоювання одного об’єкта іншому(операція « = »).
//3. Порівняння за ціною двох пальто одного типу(операція « > »).

//Завдання №2
//Створити клас Flat(квартира).Реалізувати перевантажені оператори :
//1. Перевірка на рівність площ квартир(операція « == »).
//2. Операцію присвоювання одного об’єкта іншому(операція « = »).
//3. Порівняння двох квартир за ціною(операція « > »).


int main()
{
	
	// проверки к первому заданию
	Overcoat type1("Trench coat",100.99);
	Overcoat type2("Leather jacket",90.99);
	Overcoat type3("Hoodie",80.50);
	Overcoat type4("Parka",111.11);
	cout << (type1 == type2) << endl;// проверка на равенство 1 равны 0 не равны
	type1 = type4;
	cout << (type1 == type4) << endl;// проверка на равенство 1 равны0 не равны
	cout << (type1 > type4) << endl; // проверка на равенство цены 1 первая больше 0 равны -1 первая меньше
	cout << (type3 > type2) << endl; // проверка на равенство цены 1 первая больше 0 равны -1 первая меньше
	cout << (type1 > type4) << endl; // проверка на равенство цены 1 первая больше 0 равны -1 первая меньше
	Overcoat type5 = type2;
	cout << (type5 > type2) << endl; // проверка на равенство цены 1 первая больше 0 равны -1 первая меньше

	// проверки к второму заданию
	cout << "2 exercise" << endl;
	Flat F1(54.6, 154200);
	Flat F2(54.6, 134200);
	Flat F3(79.6, 254200);
	Flat F4(87.5, 224200);
	Flat F5;
	F5 = F1;
	cout << (F1 == F4) << endl;// проверка на равенство 1 равны 0 не равны
	cout << (F1 == F2) << endl;// проверка на равенство 1 равны 0 не равны
	cout << (F1 > F4) << endl; // проверка на равенство цены 1 первая больше 0 равны -1 первая меньше
	cout << (F5 > F2) << endl; // проверка на равенство цены 1 первая больше 0 равны -1 первая меньше
	return 0;
}